In [1]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.DataFrame(np.random.rand(3,4),index=["R1","R2","R3"],columns=["C1","C2","C3","C4"])
df1

          C1        C2        C3        C4
R1  0.825850  0.726485  0.812986  0.303590
R2  0.125689  0.827390  0.784729  0.380312
R3  0.741427  0.248801  0.280552  0.830812

In [ ]:
#열별 합 구하기
df1.sum()

C1    1.692966
C2    1.802675
C3    1.878267
C4    1.514715
dtype: float64

In [ ]:
#행별 합 구하기
df1.sum(axis='columns')

R1    2.668910
R2    2.118120
R3    2.101593
dtype: float64

In [ ]:
#열별 평균 구하기 - NaN 취급의 기본설정은 제외하고 계산
df1.mean()

C1    0.564322
C2    0.600892
C3    0.626089
C4    0.504905
dtype: float64

In [6]:
# 열별 최댓값이 들어있는 행을 출력
df1.idxmax()

C1    R1
C2    R2
C3    R1
C4    R3
dtype: object

In [7]:
#행 방향으로 누적값 계산 (cumsum)
df1.cumsum()

          C1        C2        C3        C4
R1  0.825850  0.726485  0.812986  0.303590
R2  0.951539  1.553875  1.597715  0.683903
R3  1.692966  1.802675  1.878267  1.514715

In [8]:
#각 열의 개수,평균,표준편차,최댓값,최솟값,분위수
df1.describe()

             C1        C2        C3        C4
count  3.000000  3.000000  3.000000  3.000000
mean   0.564322  0.600892  0.626089  0.504905
std    0.382206  0.309066  0.299577  0.284839
min    0.125689  0.248801  0.280552  0.303590
25%    0.433558  0.487643  0.532641  0.341951
50%    0.741427  0.726485  0.784729  0.380312
75%    0.783639  0.776937  0.798857  0.605562
max    0.825850  0.827390  0.812986  0.830812

In [ ]:
df2 = pd.read_csv('./data/survey.csv')
df2.head()

  gender  income
0      m    3000
1      f    4000
2      f    5000
3      m    6800
4      m    6200

In [28]:
df2.income.mean()

np.float64(5534.4)

In [29]:
df2.income.sum()

np.int64(110688)

In [30]:
df2.income.median()

np.float64(5250.0)

In [31]:
df2.describe()

            income
count    20.000000
mean   5534.400000
std    1407.357262
min    3000.000000
25%    4997.500000
50%    5250.000000
75%    6425.000000
max    8000.000000

In [32]:
df2.income.describe()

count      20.000000
mean     5534.400000
std      1407.357262
min      3000.000000
25%      4997.500000
50%      5250.000000
75%      6425.000000
max      8000.000000
Name: income, dtype: float64

In [33]:
df2.gender.value_counts()

gender
m    11
f     9
Name: count, dtype: int64

In [34]:
df2.groupby(df2.gender).describe()

       income                                                            \
        count         mean          std     min     25%     50%     75%
gender
f         9.0  5409.888889  1321.647688  4000.0  4990.0  5000.0  5700.0
m        11.0  5636.272727  1529.860392  3000.0  5000.0  5999.0  6550.0


           max
gender
f       8000.0
m       8000.0